Omar-Magdy0/EcoDrive/platform/stm32f4/eldriver/eldriver_mc3p.c
    LL_ADC_CommonInit(__LL_ADC_COMMON_INSTANCE(ADC1), &adc1CommonInitStruct);
    LL_ADC_Init(ADC1, &adc1InitStruct);

    // Enable ADC
    if (LL_ADC_IsEnabled(ADC1) == 0) 
    {
        LL_ADC_Enable(ADC1);
    }

    //Calibrate Adc
    mc3p_adc_calibrate(h);

    // Initialize ADC regular group for slow measurements
    LL_ADC_REG_InitTypeDef adc1RegInitStruct = {    
        .TriggerSource = LL_ADC_REG_TRIG_SOFTWARE,
        .SequencerLength = LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS,
        .SequencerDiscont = LL_ADC_REG_SEQ_DISCONT_3RANKS,
        .ContinuousMode = LL_ADC_REG_CONV_CONTINUOUS,
        .DMATransfer = LL_ADC_REG_DMA_TRANSFER_UNLIMITED
    };
    LL_ADC_REG_Init(ADC1, &adc1RegInitStruct);
    

    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_18, LL_ADC_SAMPLINGTIME_56CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_18, LL_ADC_SAMPLINGTIME_56CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_18, LL_ADC_SAMPLINGTIME_56CYCLES);
    
    // Initialize ADC injected group for time-critical measurements
    LL_ADC_INJ_InitTypeDef adc1InjInitStruct = {
        .TriggerSource = LL_ADC_INJ_TRIG_EXT_TIM1_TRGO,
        .SequencerLength = LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS,
        .SequencerDiscont = LL_ADC_INJ_SEQ_DISCONT_DISABLE,
        .TrigAuto = LL_ADC_INJ_TRIG_INDEPENDENT
    };                                                      

    // Set sampling times for all PWM Scan channels (injected group)
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_VSBUS_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_28CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_VSU_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_28CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_VSV_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_28CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_VSW_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_28CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_CSU_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_15CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_CSV_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_15CYCLES);
    LL_ADC_SetChannelSamplingTime(ADC1, ELDRIVER_MC3P_CSW_ADC_CHANNEL, LL_ADC_SAMPLINGTIME_15CYCLES);

    LL_ADC_INJ_Init(ADC1, &adc1InjInitStruct);
    //ADC CONFIGURATIONS AND LINKAGE TO TIM1 TRGO
    LL_ADC_INJ_StartConversionExtTrig(ADC1, LL_ADC_INJ_TRIG_EXT_RISING);
    
    //## Configure use TIM1 CH4 for adc triggering (we exlusively use CH4 for adc triggering)
    //==================================================================
    // USE CHANNEL 4 Exlusively FOR Injected Adc channel (adcPWM Scan)
    //==================================================================
    LL_TIM_OC_InitTypeDef ch4_tim1_OCInit = 
    {
        .OCMode = LL_TIM_OCMODE_PWM1,           // Change to PWM mode
        .OCState = LL_TIM_OCSTATE_ENABLE,       // Enable the output
        .CompareValue = (LL_TIM_GetAutoReload(TIM1) + 1) / 2, // Mid-point for center-aligned
        .OCPolarity = LL_TIM_OCPOLARITY_HIGH,   // Rising edge at compare match
        .OCIdleState = LL_TIM_OCIDLESTATE_LOW,
    };
    LL_TIM_OC_EnablePreload(TIM1, LL_TIM_CHANNEL_CH4);
    LL_TIM_OC_Init(TIM1, LL_TIM_CHANNEL_CH4, &ch4_tim1_OCInit);
 
    // Set as trigger output (for ADC synchronization)
    LL_TIM_SetTriggerOutput(TIM1, LL_TIM_TRGO_OC4REF);

    // Enable ADC interrupts
    LL_ADC_EnableIT_JEOS(ADC1);  // Injected sequence end interrupt  
}


#include <stm32f4xx_ll_gpio.h>
#define MC3P_ADC_GpioInit(port, pin)do{\
    LL_GPIO_InitTypeDef GPIO_InitStruct = {0};\
    GPIO_InitStruct.Pin = pin;\
    GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;\
    LL_GPIO_Init(port, &GPIO_InitStruct);\
}while(0)

#define MC3P_PWM_GpioInit(port, pin, active)do{\
    LL_GPIO_InitTypeDef GPIO_InitStruct = {0};\
    GPIO_InitStruct.Pin = pin;\
    GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;\
    GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;\
    GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;\
    GPIO_InitStruct.Pull = active?LL_GPIO_PULL_DOWN : LL_GPIO_PULL_UP;\
    GPIO_InitStruct.Alternate = LL_GPIO_AF_1;\
    LL_GPIO_Init(port, &GPIO_InitStruct);\
}while(0)


void mc3p_gpio_init()
{     
    MC3P_PWM_GpioInit(ELDRIVER_MC3P_UH_PORT, ELDRIVER_MC3P_UH_PIN, ELDRIVER_MC3P_HIN_ACTIVE);
    MC3P_PWM_GpioInit(ELDRIVER_MC3P_VH_PORT, ELDRIVER_MC3P_VH_PIN, ELDRIVER_MC3P_HIN_ACTIVE);
    MC3P_PWM_GpioInit(ELDRIVER_MC3P_WH_PORT, ELDRIVER_MC3P_WH_PIN, ELDRIVER_MC3P_HIN_ACTIVE);
    MC3P_PWM_GpioInit(ELDRIVER_MC3P_UL_PORT, ELDRIVER_MC3P_UL_PIN, ELDRIVER_MC3P_LIN_ACTIVE);
    MC3P_PWM_GpioInit(ELDRIVER_MC3P_VL_PORT, ELDRIVER_MC3P_VL_PIN, ELDRIVER_MC3P_LIN_ACTIVE);
    MC3P_PWM_GpioInit(ELDRIVER_MC3P_WL_PORT, ELDRIVER_MC3P_WL_PIN, ELDRIVER_MC3P_LIN_ACTIVE);
    //Initialize adc pins
    MC3P_ADC_GpioInit(ELDRIVER_MC3P_VSBUS_PORT, ELDRIVER_MC3P_VSBUS_PIN);
    MC3P_ADC_GpioInit(ELDRIVER_MC3P_VSU_PORT, ELDRIVER_MC3P_VSU_PIN);
    MC3P_ADC_GpioInit(ELDRIVER_MC3P_VSV_PORT, ELDRIVER_MC3P_VSV_PIN);
    MC3P_ADC_GpioInit(ELDRIVER_MC3P_VSW_PORT, ELDRIVER_MC3P_VSW_PIN);
    
    // Optional: External VREF if used
    #ifdef ELDRIVER_MC3P_EXTERNAL_VREF

    #endif
}

//================================================================================================================
// DMA Initialization
//================================================================================================================
void mc3p_dma_init()
{
    // Enable DMA2 clock (ADC1 is connected to DMA2 on STM32F4)
    __HAL_RCC_DMA2_CLK_ENABLE();
    
    // =================================================================
    // DMA for ADC1 Regular Scan (Slow Monitoring Channels)
    // =================================================================
    
    // Configure DMA channel first (ADC1 uses Channel 0 for Stream 0)
    LL_DMA_SetChannelSelection(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, MC3P_DMA_CHANNEL);
    
    // Configure DMA parameters for ADC1 regular conversions
    LL_DMA_SetDataTransferDirection(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
    LL_DMA_SetStreamPriorityLevel(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_PRIORITY_MEDIUM);
    LL_DMA_SetMode(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_MODE_CIRCULAR);
    LL_DMA_SetPeriphIncMode(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_PERIPH_NOINCREMENT);
    LL_DMA_SetMemoryIncMode(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_MEMORY_INCREMENT);
    LL_DMA_SetPeriphSize(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_PDATAALIGN_HALFWORD);
    LL_DMA_SetMemorySize(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, LL_DMA_MDATAALIGN_HALFWORD);
    LL_DMA_DisableFifoMode(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM);
    
    // Set peripheral address (ADC1 data register)
    LL_DMA_SetPeriphAddress(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, (uint32_t)&(ADC1->DR));
    
    // Set memory address (double buffer start)
    LL_DMA_SetMemoryAddress(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, (uint32_t)mc3p_bg_data[0]);
    
    // Set data length (total samples across both buffers)
    LL_DMA_SetDataLength(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM, ELDRIVER_MC3P_BG_CHANNELS);

    // Enable DMA transfer complete and half transfer interrupts
    LL_DMA_EnableIT_TC(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM);
    LL_DMA_EnableIT_HT(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM);
    
    // Enable DMA stream
    LL_DMA_EnableStream(MC3P_DMA_INSTANCE, MC3P_DMA_BACKGROUND_STREAM);
}


//================================================================================================================
// Interrupt Initialization
//================================================================================================================
void mc3p_interrupt_init(){
    // Regular scan DMA interrupt - use LL macros for portability
    NVIC_SetPriority(DMA2_Stream0_IRQn, 5);  // Medium priority for slow monitoring
    NVIC_EnableIRQ(DMA2_Stream0_IRQn);

    // ADC Injected End of Conversion (JEOC) interrupt - Higher priority for time-critical measurements
    NVIC_SetPriority(ADC_IRQn, 0);           // Higher priority than DMA for PWM-synchronized measurements
    NVIC_EnableIRQ(ADC_IRQn);
    
    // Enable JEOS (Injected End Of Sequence) interrupt in ADC
    LL_ADC_EnableIT_JEOS(ADC1);
}


static void mc3p_tim1_init(eldriver_mc3p_t *h){
    //ENABLE Peripheral CLOCK
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1);
    //===================================================== 
    // BASIC TIMER CONFIGURATION
    //=====================================================
    LL_TIM_InitTypeDef tim1Init =
    {
        .Prescaler = 0,
        .CounterMode = LL_TIM_COUNTERMODE_CENTER_UP,
        .Autoreload = __LL_TIM_CALC_ARR(HAL_RCC_GetPCLK2Freq(), 1, h->config.pwm_Hz),
        .ClockDivision = LL_TIM_CLOCKDIVISION_DIV1,
        .RepetitionCounter = 0
    };
    LL_TIM_EnableARRPreload(TIM1);
    LL_TIM_SetUpdateSource(TIM1, LL_TIM_UPDATESOURCE_REGULAR);
    LL_TIM_Init(TIM1, &tim1Init);
    //===================================================== 
    // ADVANCED TIMER CONFIGURATION (BREAK AND DEADTIME)
    //=====================================================
    LL_TIM_BDTR_InitTypeDef tim1BDTRInit = {
        .OSSRState = LL_TIM_OSSR_ENABLE,
        .OSSIState = LL_TIM_OSSI_DISABLE,
        .LockLevel = LL_TIM_LOCKLEVEL_OFF,
        .DeadTime = (uint8_t)(__LL_TIM_CALC_DEADTIME(HAL_RCC_GetPCLK2Freq(), LL_TIM_GetClockDivision(TIM1), h->config.deadtime_nS)),
        .BreakState = LL_TIM_BREAK_DISABLE,
        .BreakPolarity = LL_TIM_BREAK_POLARITY_HIGH,
        .AutomaticOutput = LL_TIM_AUTOMATICOUTPUT_DISABLE
    };
    LL_TIM_BDTR_Init(TIM1, &tim1BDTRInit);
    //===================================================== 
    // IDENTICAL OUTPUT CHANNEL CONFIGURATION ON CHANNEL 1,2,3
    //=====================================================
    LL_TIM_OC_InitTypeDef ch1ch2ch3_tim1_OCInit = 
    {
        .OCMode = LL_TIM_OCMODE_INACTIVE,
        .OCState = LL_TIM_OCSTATE_ENABLE,
        .OCNState = LL_TIM_OCSTATE_DISABLE,
        .CompareValue = 0,
        .OCPolarity = ELDRIVER_MC3P_HIN_ACTIVE ? LL_TIM_OCPOLARITY_HIGH : LL_TIM_OCPOLARITY_LOW,
        .OCNPolarity = ELDRIVER_MC3P_LIN_ACTIVE ? LL_TIM_OCPOLARITY_HIGH : LL_TIM_OCPOLARITY_LOW,
        .OCIdleState = ELDRIVER_MC3P_HIN_ACTIVE ? LL_TIM_OCIDLESTATE_LOW: LL_TIM_OCIDLESTATE_HIGH,
        .OCNIdleState = ELDRIVER_MC3P_LIN_ACTIVE ? LL_TIM_OCIDLESTATE_LOW : LL_TIM_OCIDLESTATE_HIGH
    };
    LL_TIM_OC_Init(TIM1, LL_TIM_CHANNEL_CH1, &ch1ch2ch3_tim1_OCInit);
    LL_TIM_OC_Init(TIM1, LL_TIM_CHANNEL_CH2, &ch1ch2ch3_tim1_OCInit);
    LL_TIM_OC_Init(TIM1, LL_TIM_CHANNEL_CH3, &ch1ch2ch3_tim1_OCInit);
    LL_TIM_OC_EnablePreload(TIM1, LL_TIM_CHANNEL_CH1);
    LL_TIM_OC_EnablePreload(TIM1, LL_TIM_CHANNEL_CH2);
    LL_TIM_OC_EnablePreload(TIM1, LL_TIM_CHANNEL_CH3);
    LL_TIM_CC_EnablePreload(TIM1);
   
   
