Omar-Magdy0/EcoDrive/platform/stm32f4/eldriver/eldriver_mc3p.c
    //GET TIMER MAX MAX VALUE TO BE USED FOR DUTY CALCULATION
    h->timer_max_q15 = LL_TIM_GetAutoReload(TIM1);
    // Finally enable the timer (Configuration done)
    LL_TIM_EnableAllOutputs(TIM1);
    LL_TIM_EnableCounter(TIM1);
}


void eldriver_mc3p_init(eldriver_mc3p_t *h)
{
    mc3p_gpio_init();
    mc3p_tim1_init(h);
    h->duty_max_q15 = (uint16_t)((h->config.duty_max) * 0x7FFF);
    h->duty_min_q15 = (uint16_t)((h->config.duty_min) * 0x7FFF);

    mc3p_adc_init(h);
    mc3p_dma_init();
    h->sector_last = ELDRIVER_MC3P_SECTOR_FLOAT;
    h->mode        = ELDRIVER_MC3P_MODE_NONE;
    mc3p_irq_bind(h);
    mc3p_interrupt_init();
    if(h->offset_calibration)mc3p_offset_calibration(h);
}

//======================================================
// Phase Ouptut functions
//======================================================
void eldriver_mc3p_write_phase_state(eldriver_mc3p_t *h, eldriver_mc3p_phase_state_t state_u, eldriver_mc3p_phase_state_t state_v, eldriver_mc3p_phase_state_t state_w)
{
    uint32_t ccer_shadow = TIM1->CCER;
    uint32_t ccmr1_shadow = TIM1->CCMR1;
    uint32_t ccmr2_shadow = TIM1->CCMR2;
    ccer_shadow |= (CC1E_MASK | CC2E_MASK | CC3E_MASK | CC1NE_MASK | CC2NE_MASK | CC3NE_MASK);  // Set all OCxNE & OCxE bits
    ccmr1_shadow &= ~(OC1M_MASK | OC2M_MASK);  // Clear OC1M bits & OC2M bits
    ccmr2_shadow &= ~OC3M_MASK;  // Clear OC3M bits

    //Operations to be done here
    switch(state_u)
    {
        case(ELDRIVER_MC3P_PHASE_FLOAT)  :   {ccmr1_shadow |= OC1M_INACTIVE; ccer_shadow  &= ~(CC1E_MASK); break;}
        case(ELDRIVER_MC3P_PHASE_L_ON)   :   {ccmr1_shadow |= OC1M_INACTIVE; break;}
        case(ELDRIVER_MC3P_PHASE_H_ON)   :   {ccmr1_shadow |= OC1M_ACTIVE;   break;}
        case(ELDRIVER_MC3P_PHASE_COMP)   :   {ccmr1_shadow |= OC1M_PWM;      break;}
        case(ELDRIVER_MC3P_PHASE_L_PWM)  :   {ccmr1_shadow |= OC1M_PWM   ; ccer_shadow &=  ~(CC1E_MASK); break;}
        case(ELDRIVER_MC3P_PHASE_H_PWM)  :   {ccmr1_shadow |= OC1M_PWM   ; ccer_shadow &=  ~(CC1NE_MASK); break;}
    }
    switch(state_v)
    {        
        case(ELDRIVER_MC3P_PHASE_FLOAT)  :   {ccmr1_shadow |= OC2M_INACTIVE; ccer_shadow  &= ~(CC2E_MASK); break;}
        case(ELDRIVER_MC3P_PHASE_L_ON)   :   {ccmr1_shadow |= OC2M_INACTIVE; break;}
        case(ELDRIVER_MC3P_PHASE_H_ON)   :   {ccmr1_shadow |= OC2M_ACTIVE;   break;}
        case(ELDRIVER_MC3P_PHASE_COMP)   :   {ccmr1_shadow |= OC2M_PWM;      break;}
        case(ELDRIVER_MC3P_PHASE_L_PWM)  :   {ccmr1_shadow |= OC2M_PWM   ; ccer_shadow &=  ~(CC2E_MASK); break;}
        case(ELDRIVER_MC3P_PHASE_H_PWM)  :   {ccmr1_shadow |= OC2M_PWM   ; ccer_shadow &=  ~(CC2NE_MASK); break;}
    }
    switch(state_w)
    {
        case(ELDRIVER_MC3P_PHASE_FLOAT)  :   {ccmr2_shadow |= OC3M_INACTIVE; ccer_shadow  &= ~(CC3E_MASK); break;}
        case(ELDRIVER_MC3P_PHASE_L_ON)   :   {ccmr2_shadow |= OC3M_INACTIVE; break;}
        case(ELDRIVER_MC3P_PHASE_H_ON)   :   {ccmr2_shadow |= OC3M_ACTIVE;   break;}
        case(ELDRIVER_MC3P_PHASE_COMP)   :   {ccmr2_shadow |= OC3M_PWM;      break;}
        case(ELDRIVER_MC3P_PHASE_L_PWM)  :   {ccmr2_shadow |= OC3M_PWM   ; ccer_shadow &=  ~(CC3E_MASK); break;}
        case(ELDRIVER_MC3P_PHASE_H_PWM)  :   {ccmr2_shadow |= OC3M_PWM   ; ccer_shadow &=  ~(CC3NE_MASK); break;}
    }

    TIM1->CCER = ccer_shadow;
    TIM1->CCMR1 = ccmr1_shadow;
    TIM1->CCMR2 = ccmr2_shadow;
    TIM1->EGR |= TIM_EGR_COMG;
}

void eldriver_mc3p_write_phase_duty(eldriver_mc3p_t *h, uint16_t dutyu_q15, uint16_t dutyv_q15, uint16_t dutyw_q15)
{
    uint32_t compare_u = ((uint32_t)SATURATE(dutyu_q15, h->duty_min_q15, h->duty_max_q15) * h->timer_max_q15) >> 15;
    uint32_t compare_v = ((uint32_t)SATURATE(dutyv_q15, h->duty_min_q15, h->duty_max_q15) * h->timer_max_q15) >> 15;
    uint32_t compare_w = ((uint32_t)SATURATE(dutyw_q15, h->duty_min_q15, h->duty_max_q15) * h->timer_max_q15) >> 15;
    TIM1->CCR1 = compare_u;
    TIM1->CCR2 = compare_v;
    TIM1->CCR3 = compare_w;
}

void eldriver_mc3p_write_float(eldriver_mc3p_t *h)
{    
    eldriver_mc3p_write_phase_state(h, ELDRIVER_MC3P_PHASE_FLOAT, ELDRIVER_MC3P_PHASE_FLOAT, ELDRIVER_MC3P_PHASE_FLOAT);
    eldriver_mc3p_write_phase_duty(h, 0, 0, 0);
    h->sector_last = ELDRIVER_MC3P_SECTOR_FLOAT;
}



typedef struct {
    eldriver_mc3p_phase_state_t phase_state[3]; // A,B,C: COMP, L_ON, FLOAT
} mc3p_trap_sector_map_t;


static const mc3p_trap_sector_map_t trap_table[6] = {
    [ELDRIVER_MC3P_SECTOR_TRAP1 - 1] = { {ELDRIVER_MC3P_PHASE_COMP, ELDRIVER_MC3P_PHASE_L_ON, ELDRIVER_MC3P_PHASE_FLOAT}},
    [ELDRIVER_MC3P_SECTOR_TRAP2 - 1] = { {ELDRIVER_MC3P_PHASE_COMP, ELDRIVER_MC3P_PHASE_FLOAT, ELDRIVER_MC3P_PHASE_L_ON}},
    [ELDRIVER_MC3P_SECTOR_TRAP3 - 1] = { {ELDRIVER_MC3P_PHASE_FLOAT, ELDRIVER_MC3P_PHASE_COMP, ELDRIVER_MC3P_PHASE_L_ON}},
    [ELDRIVER_MC3P_SECTOR_TRAP4 - 1] = { {ELDRIVER_MC3P_PHASE_L_ON, ELDRIVER_MC3P_PHASE_COMP, ELDRIVER_MC3P_PHASE_FLOAT}},
    [ELDRIVER_MC3P_SECTOR_TRAP5 - 1] = { {ELDRIVER_MC3P_PHASE_L_ON, ELDRIVER_MC3P_PHASE_FLOAT, ELDRIVER_MC3P_PHASE_COMP}},
    [ELDRIVER_MC3P_SECTOR_TRAP6 - 1] = { {ELDRIVER_MC3P_PHASE_FLOAT, ELDRIVER_MC3P_PHASE_L_ON, ELDRIVER_MC3P_PHASE_COMP}},
};

void eldriver_mc3p_write_trap(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector, uint16_t duty_q15)
{
    if(!IS_TRAP_SECTOR(h->sector_last))
    {
        mc3p_adc_mode(h, sector);
        h->mode        = ELDRIVER_MC3P_MODE_TRAP;
    }
 

    if(sector < ELDRIVER_MC3P_SECTOR_TRAP1 || sector > ELDRIVER_MC3P_SECTOR_TRAP6)
        return;

    const mc3p_trap_sector_map_t *map = &trap_table[sector - 1];

    // Only update phase state & ADC if sector changed
    if(h->sector_last != sector)
    {
        eldriver_mc3p_write_phase_state(h, map->phase_state[0], map->phase_state[1], map->phase_state[2]);
        mc3p_adc_trap_update(h, sector);
        h->sector_last = sector;
    }
    eldriver_mc3p_write_phase_duty(h, duty_q15, duty_q15, duty_q15);
}

void eldriver_mc3p_write_svm(eldriver_mc3p_t *h, int16_t alpha_q15, int16_t beta_q15) 
{
    int32_t vmax, vmin, voff;
    if(!IS_SVM_SECTOR(h->sector_last))
    {
        eldriver_mc3p_write_phase_state(h, ELDRIVER_MC3P_PHASE_COMP, ELDRIVER_MC3P_PHASE_COMP, ELDRIVER_MC3P_PHASE_COMP);
        h->mode        = ELDRIVER_MC3P_MODE_SVM;
    }

    /* αβ → phase (normalized Q15) */
    h->dutyu_q15 = alpha_q15;

    h->dutyv_q15 = (-(int32_t)Q15_HALF * alpha_q15
         + (int32_t)Q15_SQRT3_BY_2 * beta_q15) >> 15;

