Omar-Magdy0/EcoDrive/platform/stm32f4/eldriver/eldriver_mc3p.c
    h->dutyw_q15 = (-(int32_t)Q15_HALF * alpha_q15
         - (int32_t)Q15_SQRT3_BY_2 * beta_q15) >> 15;

    /* SVPWM zero-sequence injection */
    uint8_t b0 = (h->dutyu_q15 >= 0);
    uint8_t b1 = (h->dutyv_q15 >= 0);
    uint8_t b2 = (h->dutyw_q15 >= 0);

    // 3-bit code
    uint8_t code = (b2 << 2) | (b1 << 1) | b0;
    eldriver_mc3p_sector_t sector;
    switch(code)
    {
        case 0b001: sector = 1; break;
        case 0b011: sector = 2; break;
        case 0b010: sector = 3; break;
        case 0b110: sector = 4; break;
        case 0b100: sector = 5; break;
        case 0b101: sector = 6; break;
        default: sector = 0; break; // should not happen
    }
     /* SVPWM zero-sequence injection */
    vmax = h->dutyu_q15;
    if (h->dutyv_q15 > vmax) vmax = h->dutyv_q15;
    if (h->dutyw_q15 > vmax) vmax = h->dutyw_q15;

    vmin = h->dutyu_q15;
    if (h->dutyv_q15 < vmin) vmin = h->dutyv_q15;
    if (h->dutyw_q15 < vmin) vmin = h->dutyw_q15;

    voff = (vmax + vmin) >> 1;

    h->dutyu_q15 -= voff;
    h->dutyv_q15 -= voff;
    h->dutyw_q15 -= voff;
    mc3p_adc_svm_update(h, sector);
    eldriver_mc3p_write_phase_duty(h, h->dutyu_q15, h->dutyv_q15, h->dutyw_q15);
    h->sector_last = sector;
}

//==============================================
// Analog Reading functions
//==============================================
void mc3p_adc_mode(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector)
{
    uint8_t is_svm = IS_SVM_SECTOR(sector);
    uint8_t is_trap = IS_TRAP_SECTOR(sector);
    if(is_svm)
    {
        LL_ADC_INJ_SetSequencerLength(ADC1, LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_1, ELDRIVER_MC3P_VSBUS_ADC_CHANNEL);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_2, ELDRIVER_MC3P_CSU_ADC_CHANNEL);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_3, ELDRIVER_MC3P_CSV_ADC_CHANNEL);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_4, ELDRIVER_MC3P_CSW_ADC_CHANNEL);
        h->sync_rank_scale[0] = ELDRIVER_MC3P_VSBUS;
        h->sync_rank_scale[1] = ELDRIVER_MC3P_CSU;
        h->sync_rank_scale[2] = ELDRIVER_MC3P_CSV;
        h->sync_rank_scale[3] = ELDRIVER_MC3P_CSW;
    }else if(is_trap)
    {
        LL_ADC_INJ_SetSequencerLength(ADC1, LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_1, ELDRIVER_MC3P_VSBUS_ADC_CHANNEL);
        h->sync_rank_scale[0] = ELDRIVER_MC3P_VSBUS;
    }
}

void mc3p_adc_svm_update(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector)
{
    
}


typedef struct {
    uint32_t rank2_channel;
    uint32_t rank3_channel;
    uint8_t  rank2_scale_idx;
    uint8_t  rank3_scale_idx;
} mc3p_adc_map_t;

static const mc3p_adc_map_t adc_trap_table[6] = {
    [ELDRIVER_MC3P_SECTOR_TRAP1 - 1] = { ELDRIVER_MC3P_VSW_ADC_CHANNEL, ELDRIVER_MC3P_CSV_ADC_CHANNEL, ELDRIVER_MC3P_VSW, ELDRIVER_MC3P_CSV},
    [ELDRIVER_MC3P_SECTOR_TRAP2 - 1] = { ELDRIVER_MC3P_VSV_ADC_CHANNEL, ELDRIVER_MC3P_CSW_ADC_CHANNEL, ELDRIVER_MC3P_VSV, ELDRIVER_MC3P_CSW},
    [ELDRIVER_MC3P_SECTOR_TRAP3 - 1] = { ELDRIVER_MC3P_VSU_ADC_CHANNEL, ELDRIVER_MC3P_CSW_ADC_CHANNEL, ELDRIVER_MC3P_VSU, ELDRIVER_MC3P_CSW},
    [ELDRIVER_MC3P_SECTOR_TRAP4 - 1] = { ELDRIVER_MC3P_VSW_ADC_CHANNEL, ELDRIVER_MC3P_CSU_ADC_CHANNEL, ELDRIVER_MC3P_VSW, ELDRIVER_MC3P_CSU},
    [ELDRIVER_MC3P_SECTOR_TRAP5 - 1] = { ELDRIVER_MC3P_VSV_ADC_CHANNEL, ELDRIVER_MC3P_CSU_ADC_CHANNEL, ELDRIVER_MC3P_VSV, ELDRIVER_MC3P_CSU},
    [ELDRIVER_MC3P_SECTOR_TRAP6 - 1] = { ELDRIVER_MC3P_VSU_ADC_CHANNEL, ELDRIVER_MC3P_CSV_ADC_CHANNEL, ELDRIVER_MC3P_VSU, ELDRIVER_MC3P_CSV},
};

void mc3p_adc_trap_update(eldriver_mc3p_t *h, eldriver_mc3p_sector_t sector)
{
    const mc3p_adc_map_t *map = &adc_trap_table[sector - 1];
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_2, map->rank2_channel);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_3, map->rank3_channel);
}

#include <string.h>
void eldriver_mc3p_read_sync(eldriver_mc3p_t *h, void* data)
{
    uint8_t is_svm = IS_SVM_SECTOR(h->sector_last);
    uint8_t is_trap = IS_TRAP_SECTOR(h->sector_last);
    if(is_svm)
    {
        ((eldriver_mc3p_trap_data_t *)(data))->vbus_q31  = (h->sync_scale_q31[h->sync_rank_scale[0]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[0]][1]);
        ((eldriver_mc3p_svm_data_t *)(data))->cu_q31     = (h->sync_scale_q31[h->sync_rank_scale[1]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[1]][1]);
        ((eldriver_mc3p_svm_data_t *)(data))->cv_q31     = (h->sync_scale_q31[h->sync_rank_scale[2]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_2)) + h->sync_scale_q31[h->sync_rank_scale[2]][1]);  
        ((eldriver_mc3p_svm_data_t *)(data))->cw_q31     = (h->sync_scale_q31[h->sync_rank_scale[3]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_3)) + h->sync_scale_q31[h->sync_rank_scale[3]][1]);        
    }
    else if (is_trap)
    {
        ((eldriver_mc3p_trap_data_t *)(data))->vbus_q31  = (h->sync_scale_q31[h->sync_rank_scale[0]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[0]][1]);
        ((eldriver_mc3p_trap_data_t *)(data))->vbemf_q31 = (h->sync_scale_q31[h->sync_rank_scale[1]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_2)) + h->sync_scale_q31[h->sync_rank_scale[1]][1]);
        ((eldriver_mc3p_trap_data_t *)(data))->cbus_q31  = (h->sync_scale_q31[h->sync_rank_scale[2]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_3)) + h->sync_scale_q31[h->sync_rank_scale[2]][1]);
    }
    else{
        ((eldriver_mc3p_trap_data_t *)(data))->vbus_q31  = (h->sync_scale_q31[h->sync_rank_scale[0]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[0]][1]);
    }
}

uint8_t eldriver_mc3p_read_bg(eldriver_mc3p_t *h, float* scanData)
{
    uint8_t readBuffer = 1 - mc3p_bg_active_buffer; // Always read from inactive buffer
    for(int i = 0; i < ELDRIVER_MC3P_BG_CHANNELS; i++)
    {
        mc3p_bg_data_V[i] = (h->adc_to_uV * (mc3p_bg_data[readBuffer][i]) ) / 1000000.0;
    }
    memcpy(scanData, mc3p_bg_data_V, ELDRIVER_MC3P_BG_CHANNELS * sizeof(float));
    isReady = 0;
    return ELDRIVER_MC3P_BG_CHANNELS;
}


void eldriver_mc3p_bg_startConv(eldriver_mc3p_t *h)
{
    isReady = 0;
    LL_ADC_REG_StartConversionSWStart(ADC1);
}

uint8_t eldriver_mc3p_bg_channels(eldriver_mc3p_t *h)
{
    return ELDRIVER_MC3P_BG_CHANNELS;
}

uint8_t eldriver_mc3p_bg_isReady(eldriver_mc3p_t *h)
{
    return isReady;
}


void DMA2_Stream0_IRQHandler(void)
{
    if (LL_DMA_IsActiveFlag_HT0(MC3P_DMA_INSTANCE)) {
        LL_DMA_ClearFlag_HT0(MC3P_DMA_INSTANCE);
        // Half transfer complete - First Half samples Done
        mc3p_bg_active_buffer = 1;
        isReady = 1;
    }
    
    if (LL_DMA_IsActiveFlag_TC0(MC3P_DMA_INSTANCE)) {
        LL_DMA_ClearFlag_TC0(MC3P_DMA_INSTANCE);
        // Full transfer complete - Second Half Samples Done
        mc3p_bg_active_buffer = 0;
        isReady = 1;
    }
}


void eldriver_mc3p_setGain(eldriver_mc3p_t *h,  eldriver_mc3p_sync s, float gain)
{
    float scale = (s >= ELDRIVER_MC3P_CSU && s <= ELDRIVER_MC3P_CSW)? ELDRIVER_MC3P_CS_SCALE : ELDRIVER_MC3P_VS_SCALE;
    h->sync_scale_q31[s][0] = ((gain * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * scale));
}

