Omar-Magdy0/EcoDrive/platform/stm32f4/eldriver/eldriver_mc3p.c
void mc3p_offset_calibration(eldriver_mc3p_t *h)
{
    // Set all phases to Loww (0,0,0)
    // Set mode to calibration
    h->mode = ELDRIVER_MC3P_MODE_CALIB;
    eldriver_mc3p_write_phase_state(h, ELDRIVER_MC3P_PHASE_L_ON, ELDRIVER_MC3P_PHASE_L_ON, ELDRIVER_MC3P_PHASE_L_ON);
    eldriver_mc3p_write_phase_duty(h, 0, 0, 0);
    // Read current sensor values (the reading is your offset) (make the injected sequence suitable)
    LL_ADC_INJ_SetSequencerLength(ADC1, LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_1, ELDRIVER_MC3P_VSBUS_ADC_CHANNEL);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_2, ELDRIVER_MC3P_CSU_ADC_CHANNEL);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_3, ELDRIVER_MC3P_CSV_ADC_CHANNEL);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_4, ELDRIVER_MC3P_CSW_ADC_CHANNEL);
    for(int i = 0; i < 4; i++)h->offset_calibration_sum[i] = 0;
    h->offset_calibration_remaining_samples = ELDRIVER_MC3P_OFFSET_CALIBRATION_SAMPLES;
    while(h->offset_calibration_remaining_samples);
    // Now we have the offsets
    for(int i = 0; i < 4; i++)h->offset_calibration_sum[i] = h->offset_calibration_sum[i]/ELDRIVER_MC3P_OFFSET_CALIBRATION_SAMPLES;
    //assign the averaged adc value after Q31 scaling
    h->sync_scale_q31[ELDRIVER_MC3P_CSU][1] =  ((h->offset_calibration_sum[1] * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * ELDRIVER_MC3P_CS_SCALE));
    h->sync_scale_q31[ELDRIVER_MC3P_CSV][1] =  ((h->offset_calibration_sum[2] * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * ELDRIVER_MC3P_CS_SCALE));
    h->sync_scale_q31[ELDRIVER_MC3P_CSW][1] =  ((h->offset_calibration_sum[3] * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * ELDRIVER_MC3P_CS_SCALE));

    // Read phase voltage sensor values (the reading is your offset) (make the injected sequence suitable)
    LL_ADC_INJ_SetSequencerLength(ADC1, LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_1, ELDRIVER_MC3P_VSBUS_ADC_CHANNEL);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_2, ELDRIVER_MC3P_VSU_ADC_CHANNEL);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_3, ELDRIVER_MC3P_VSV_ADC_CHANNEL);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_4, ELDRIVER_MC3P_VSW_ADC_CHANNEL);
    for(int i = 0; i < 4; i++)h->offset_calibration_sum[i] = 0;
    h->offset_calibration_remaining_samples = ELDRIVER_MC3P_OFFSET_CALIBRATION_SAMPLES;
    while(h->offset_calibration_remaining_samples);
    // Now we have the offsets
    for(int i = 0; i < 4; i++)h->offset_calibration_sum[i] = h->offset_calibration_sum[i]/ELDRIVER_MC3P_OFFSET_CALIBRATION_SAMPLES;
    //assign the averaged adc value after Q31 scaling
    h->sync_scale_q31[ELDRIVER_MC3P_VSU][1] =  ((h->offset_calibration_sum[1] * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * ELDRIVER_MC3P_VS_SCALE));
    h->sync_scale_q31[ELDRIVER_MC3P_VSV][1] =  ((h->offset_calibration_sum[2] * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * ELDRIVER_MC3P_VS_SCALE));
    h->sync_scale_q31[ELDRIVER_MC3P_VSW][1] =  ((h->offset_calibration_sum[3] * h->adc_to_uV * (INT32_MAX) + 0.5)/(1000000.0 * ELDRIVER_MC3P_VS_SCALE));

    //Set phases to High-Z and call it a day
    h->mode = ELDRIVER_MC3P_MODE_NONE;
    eldriver_mc3p_write_float(h);
}

void INTERNAL_mc3p_ADC_JEOS_IRQ(eldriver_mc3p_t *h)
{
    switch (h->mode)
    {
    case ELDRIVER_MC3P_MODE_CALIB:
    if(h->offset_calibration_remaining_samples){
        h->offset_calibration_sum[0] += LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1);
        h->offset_calibration_sum[1] += LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_2);
        h->offset_calibration_sum[2] += LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_3);
        h->offset_calibration_sum[3] += LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_4);
        h->offset_calibration_remaining_samples--;
    }
        break;
    
    default:
        break;
    }
}